#+INCLUDE: "../../../common/header.org"
#+TITLE:  Comandos IOS
#+SUBTITLE: 
#+KEYWORDS: IOS, Packet Tracer

* General
- ~CTRL-ALT-6~ para parar un comando incorrecto
- ~?~ para conseguir siguientes comandos
- ~TAB~ para autocompletar
- Un comando con =no= deshace el comando
** Modos
- =Press RETURN to get started.=
  - Desactivado
- =Router>=
  - =show= para mostrar información
  - =enable= para configurar (privileged commands)
- =Router#=
  - Resto de comandos
  - =configure terminal= para cambiar la configuración
- =Router(config)#=
  - Raíz de la configuración

** Para activar la configuración
#+begin_src java
Router> enable
Router# configure terminal
Router(config)#
#+end_src

** Salvar la configuración
#+BEGIN_EXAMPLE
Router# write memory
Router# copy running-config startup-config
#+END_EXAMPLE

* Direcciones IP

** Asignar IP
#+BEGIN_EXAMPLE
Router(config)# interface fa0/0
Router(config-if)# ip address 192.168.6.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
Router(config)#
#+END_EXAMPLE

** Consultar IP
#+BEGIN_EXAMPLE
Router> show ip interface
Router> show ip interface brief
#+END_EXAMPLE

* Enrutamiento
** Añadir ruta
#+BEGIN_EXAMPLE
Router(config)# ip route 172.16.0.0 255.255.255.0 192.168.6.254
#+END_EXAMPLE

** Borrar ruta
#+BEGIN_EXAMPLE
Router(config)# no ip route 172.16.0.0 255.255.255.0 192.168.6.254
#+END_EXAMPLE


** Consultar rutas
#+BEGIN_EXAMPLE
Router> show ip route
#+END_EXAMPLE

* VLAN

** Consultar VLANs
#+BEGIN_EXAMPLE 
Switch> show vlan brief
Switch> show interfaces trunk
#+END_EXAMPLE

** Crear una VLAN
#+BEGIN_EXAMPLE 
Switch(config)#vlan 2
Switch(config-vlan)#name nombredevlan
Switch(config-vlan)#exit
#+END_EXAMPLE

** Asignar un puerto a una VLAN (access)
#+BEGIN_EXAMPLE 
Switch(config)#interface FastEthernet0/1
Switch(config-if)#switchport access vlan 2
#+END_EXAMPLE

** Asignar un puerto como trunk
#+BEGIN_EXAMPLE 
Switch(config)#interface FastEthernet0/1
Switch(config-if)#switchport mode trunk
#+END_EXAMPLE

** Permitir/denegar una VLAN en un puerto trunk
#+BEGIN_EXAMPLE
Switch(config)#interface FastEthernet0/1
Switch(config-if)#switchport trunk allowed vlan remove 2
Switch(config-if)#switchport trunk allowed vlan add 2
#+END_EXAMPLE

** Routers
- Los routers pueden tener interfaces virtuales, a las que llegan las tramas 802.1q de cierta VLAN.
- Estas interfaces se configuran como las demás, y se añaden a la tabla de rutas de la misma forma

#+caption: Crea la interfaz virtual =fa0/0.1= sobre la interfaz real =fa0/0=, que recibirá las tramas 802.1q de la VLAN 2.
#+BEGIN_EXAMPLE
Router(config)# interface fa0/0.1
Router(config-subif)# encap dot1q 2
Router(config-subif)# ip address 192.168.6.1 255.255.255.0
Router(config-subif)# exit
Router(config)# interface fa0/0
Router(config-if)# no shutdown
Router(config-if)# exit
#+END_EXAMPLE

#+reveal: split
#+caption: Mostrar información de las interfaces (incluido VLAN) en un router
#+BEGIN_EXAMPLE
Router# show interfaces
#+END_EXAMPLE


* STP
Consultar y poner la prioridad de un switch
#+BEGIN_EXAMPLE
Switch# show spanning-tree 
#+END_EXAMPLE

#+BEGIN_EXAMPLE
Switch(config)# spanning-tree vlan 1 priority 1
#+END_EXAMPLE

* Link agregation

Se añader a un mismo =channel-group= todos los enlaces conectados al mismo switch.

#+begin_example
Switch(config)# interface fa0/1
Switch(config-if)# channel-group 1 mode active
#+end_example

* ACL

Consultar ACLs definidas
#+begin_example
Router# show ip access-list
#+end_example

Asociar una ACL a una interfaz
#+begin_example
Router(config)# interface fa0/1
Router(config-if)# ip access-group <numero ACL> <out o in>
#+end_example

Desasociar una ACL de una interfaz
#+begin_example
Router(config)# interface fa0/1
Router(config-if)# no ip access-group <numero ACL> <out o in>
#+end_example

** ACL estándar
Crear una ACL o añadir una regla
#+BEGIN_example
Router(config)# access-list <numero> <permit o deny>  <host|source source-wildcard|any>
#+END_example

Borrar una ACLs
#+BEGIN_example
Router(config)# no access-list <numero> 
#+END_example

** ACL extendidas
Protocolo IP (hay más opciones, no explicadas aquí)
#+BEGIN_example
Router(config)# access-list <numero> <permit o deny> ip
   <host|source source-wildcard|any>
   <host|destination destination-wildcard|any>
#+END_example

Protocolo ICMP
#+BEGIN_example
Router(config)# access-list <numero> <permit o deny> icmp
   <host|source source-wildcard|any>
   <host|destination destination-wildcard|any>
#+END_example



** ACL extendidas TCP y UDP

Protocolo TCP
#+BEGIN_example
Router(config)# access-list <numero> <permit o deny> TCP
   <host|source source-wildcard|any> [puerto]
   <host|destination destination-wildcard|any> [puerto]
   [established]
#+END_example

Protocolo UDP
#+BEGIN_example
Router(config)# access-list <numero> <permit o deny> UDP
   <host|source source-wildcard|any> [puerto]
   <host|destination destination-wildcard|any> [puerto]
#+END_example

| Operador de puerto | Significa    |
|--------------------+--------------|
| eq                 | ~=~ igual    |
| lt                 | ~<~ Menor    |
| ne                 | ~≠~ No igual |
| gt                 | ~>~ Mayor    |




* Referencias
- Formatos:
  - [[file:par-4-comandos-ios.html][Transparencias]]
  - [[file:par-4-comandos-ios.pdf][PDF]]
- Creado con:
  - [[https://www.gnu.org/s/emacs/][Emacs]]
  - [[https://github.com/yjwen/org-reveal][org-reveal]]
  - [[https://www.latex-project.org/][Latex]]
